[
  "table-editor-obsidian",
  "better-word-count",
  "obsidian-dictionary-plugin",
  "cm-editor-syntax-highlight-obsidian",
  "obsidian-mind-map",
  "obsidian-outliner",
  "templater-obsidian",
  "obsidian-git",
  "url-into-selection",
  "unique-attachments",
  "consistent-attachments-and-links",
  "obsidian-plugin-prettier",
  "recent-files-obsidian"
]