[
  "table-editor-obsidian",
  "better-word-count",
  "obsidian-dictionary-plugin",
  "cm-editor-syntax-highlight-obsidian",
  "obsidian-mind-map",
  "obsidian-outliner",
  "templater-obsidian",
  "obsidian-git",
  "url-into-selection",
  "unique-attachments",
  "consistent-attachments-and-links",
  "obsidian-plugin-prettier",
  "recent-files-obsidian",
  "dataview",
  "graph-analysis",
  "nldates-obsidian",
  "markdown-prettifier",
  "obsidian-extract-pdf-highlights",
  "obsidian-advanced-uri",
  "obsidian-languagetool-plugin",
  "hotkeysplus-obsidian",
  "tag-wrangler",
  "obsidian-admonition",
  "sliding-panes-obsidian"
]