[
  "table-editor-obsidian",
  "better-word-count",
  "obsidian-dictionary-plugin",
  "cm-editor-syntax-highlight-obsidian",
  "obsidian-mind-map",
  "obsidian-outliner",
  "templater-obsidian",
  "obsidian-git",
  "url-into-selection",
  "unique-attachments",
  "consistent-attachments-and-links",
  "obsidian-plugin-prettier",
  "recent-files-obsidian",
  "dataview",
  "nldates-obsidian",
  "markdown-prettifier",
  "obsidian-extract-pdf-highlights",
  "obsidian-advanced-uri",
  "obsidian-languagetool-plugin",
  "hotkeysplus-obsidian",
  "tag-wrangler",
  "obsidian-admonition",
  "sliding-panes-obsidian",
  "calendar",
  "obsidian-markdown-formatting-assistant-plugin",
  "remember-cursor-position",
  "drawio-obsidian",
  "obsidian-style-settings",
  "obsidian-kanban",
  "obsidian-excalidraw-plugin",
  "obsidian-pandoc",
  "remotely-save",
  "graph-analysis",
  "obsidian-auto-link-title",
  "obsidian-hider",
  "breadcrumbs",
  "readwise-official",
  "obsidian-contextual-typography",
  "obsidian-tracker",
  "obsidian-image-toolkit",
  "obsidian-excel-to-markdown-table",
  "wikilinks-to-mdlinks-obsidian",
  "obsidian-import-json",
  "obsidian-better-codeblock",
  "alx-folder-note",
  "folder-note-core"
]